"""수식 실습하기"""

"""1.숫자 만들기 실습"""
# (숫자를 만들기 위해 단순히 숫자 입력)
print(273)
print(52.273)

"""1.숫자 구분 실습"""
# (type() 함수로 소수점 없는 숫자와 있는 숫자 구분 실습)
print(type(52))
print(type(52.273))

"""숫자 구분 실습하기"""
print(243 + 791)

"""숫자 연산 실습"""
# 1. 사칙 연산 실습
print("5+7=", 5+7)
print("5-7=", 5+7)
print("5*7=", 5+7)
print("5/7=", 5+7)

# 2.나누기 연산 실습
print("3/2=", 3/2)
print("3/2=", 3//2)

# 3. 나누기 나머지 실습
print("5%2=", 5%2)

# 4. 제곱 연산 실습
print("2**1=", 2**1)
print("2**2=", 2**2)
print("2**3=", 2**3)
print("2**4=", 2**4)

"""데이터 타입 변경 실습하기"""
print(100+int('100'))
print(str(100)+'100')
